app/views/quizzes/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 1]]
---

 <% @quiz.questions.each do |question| %>