app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    @question.quiz_id = (params[:quiz_id])
    @question.save!
---
INSERT INTO "questions" ("title", "correct_answer", "answer2", "answer3", "answer4", "created_at", "updated_at", "quiz_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @question = Question.find(params[:id])
    @quiz = Quiz.find(params[:quiz_id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "title" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "please please work"], ["updated_at", "2017-10-04 11:48:47.629089"], ["id", 2]]